server/app/controllers/dashes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."dash_id" = $1 AND "posts"."approved" IS NULL  [["dash_id", 1]]
---
  def show
    @user = current_user
    # @dash.reddit_pic_scrape()
    @posts = @dash.posts.where(approved: nil)

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "dashes" SET "subreddit" = $1, "updated_at" = $2 WHERE "dashes"."id" = $3  [["subreddit", "puppies"], ["updated_at", "2016-02-06 22:53:22.630094"], ["id", 1]]
---
  def add_reddit_pics
    search_term = params[:search_term]
    puts "SearchTerm: ", search_term
    @dash = Dash.find(params[:dash_id])
    @dash.subreddit = search_term
    @dash.save

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "dashes" SET "twitter_pic_search" = $1, "updated_at" = $2 WHERE "dashes"."id" = $3  [["twitter_pic_search", "cats are assholes"], ["updated_at", "2016-02-06 22:39:45.426898"], ["id", 1]]
---
  def add_twitter_pics
    search_term = params[:search_term]
    puts "SearchTerm: ", search_term
    @dash = Dash.find(params[:dash_id])
    @dash.twitter_pic_search = search_term
    @dash.save

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "dashes" SET "giphy_search" = $1, "updated_at" = $2 WHERE "dashes"."id" = $3  [["giphy_search", "cats suck"], ["updated_at", "2016-02-06 22:35:59.618652"], ["id", 1]]
---
  def add_giphy_gifs
    search_term = params[:search_term]
    puts "SearchTerm: ", search_term
    @dash = Dash.find(params[:dash_id])
    @dash.giphy_search = search_term
    @dash.save

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "dashes" SET "tumblr_pic_search" = $1, "updated_at" = $2 WHERE "dashes"."id" = $3  [["tumblr_pic_search", "catsareassholes"], ["updated_at", "2016-02-07 00:56:06.856271"], ["id", 1]]
---
  def add_tumblr_pics

    search_term = params[:search_term]
    puts "SearchTerm: ", search_term
    @dash = Dash.find(params[:dash_id])
    @dash.tumblr_pic_search = search_term
    @dash.save

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."dash_id" = $1 AND "posts"."approved" = 't'  [["dash_id", 1]]
---
  def post_queue
    @dash = Dash.find(params[:dash_id])
    @posts = Post.where(approved: true, dash_id: @dash.id)

SELECT  "dashes".* FROM "dashes" WHERE "dashes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_dash
      @dash = Dash.find(params[:id])