server/app/controllers/posts_controller.rb

  def toggle_approve
      @p = Post.find(params[:id])
    if @p.approved
      @p.toggle!(:approved)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 220]]
UPDATE "posts" SET "approved" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["approved", "t"], ["updated_at", "2016-02-06 19:50:38.874014"], ["id", 220]]

  def toggle_disapprove
      @p = Post.find(params[:id])
    if @p.approved
      @p.toggle!(:approved)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 191]]
UPDATE "posts" SET "approved" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["approved", "f"], ["updated_at", "2016-02-06 19:49:41.022495"], ["id", 191]]