server/app/views/dashes/show.html.erb

<p>
  Unapproved: <%= @dash.posts.where(approved: nil).count %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."dash_id" = $1 AND "posts"."approved" IS NULL  [["dash_id", 1]]